axaypatoliya11/stm32-h7a3zi-q-peripherals/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <string.h>
#include <math.h>
#include "stm32h7xx_hal_rcc.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc2;

IWDG_HandleTypeDef hiwdg1;

RNG_HandleTypeDef hrng;

RTC_HandleTypeDef hrtc;

UART_HandleTypeDef huart3;

WWDG_HandleTypeDef hwwdg1;

/* USER CODE BEGIN PV */

/* Support Macros */
#define __RNG__
#undef __RNG__
#define __TEMPERATURE__
#undef __TEMPERATURE__
#define __FLASH__
//#undef __FLASH__
#define __TIME_DATE_ALARM__
#undef __TIME_DATE_ALARM__
#define __IWDG__
#undef __IWDG__
#define __WWDG__
#undef __WWDG__

#ifdef __TEMPERATURE__
/* macros for temperature */
uint32_t readValue;
int tCelsius;
int tFahrenheit;
#define TS30    ((uint16_t*)((uint32_t)0x08FFF814))
#define TS110   ((uint16_t*)((uint32_t)0x08FFF818))
#endif

/* macro for UART timeout */
#define UART_TIMEOUT			100

#ifdef __FLASH__
/* macros for flash */
#define DATA_TRANSMIT_LENGTH	2048 //byte

#define BYTE_TO_BIT				8
#define DATA_WRITE_AT_A_TIME	16 //byte

#define WRITING_BUFFER_DATATYPE_UINT16	16
#define DATA_TRANSMIT_LOOP	(DATA_TRANSMIT_LENGTH*WRITING_BUFFER_DATATYPE_UINT16)/(DATA_WRITE_AT_A_TIME*BYTE_TO_BIT)

#define DATA_READ_AT_A_TIME		4 //byte
#define DATA_READ_LOOP			(DATA_TRANSMIT_LENGTH*WRITING_BUFFER_DATATYPE_UINT16)/(DATA_READ_AT_A_TIME*BYTE_TO_BIT) //32-read bits at a time & 4-bytes

uint16_t buffer_tfs[DATA_TRANSMIT_LENGTH] = {0};
uint32_t send_address = 0x080FE000U;
uint32_t rcv_address = 0x080FE000U;
#endif

#ifdef __IWDG__
/* macros for IWDG watchdog */
#define WATCHDOG_RESET_TIME		25 //in seconds
#define PRESCALAR				64 //0->4, 2->8, 4->16, 8->32, 16->64, 32->128, 64->256
#define RELOAD_VAL_FROM_SECONDS	(((WATCHDOG_RESET_TIME*1000*32000)/(4*PRESCALAR*1000))-1)
#endif

#ifdef __WWDG__
/* macros for WWDG watchdog */
#define MAX_WINDOW_VAL			3 //in seconds
#define MIN_WINDOW_VAL			0 //in seconds
#define PRESCALAR_WWDG			128
#define SYS_CLK					HAL_RCC_GetSysClockFreq()

#define SECONDS_TO_WAIT			15
#define LOOP_COUNT_WWDG			(int)(SECONDS_TO_WAIT/MAX_WINDOW_VAL)
int check_loop_count_wwdg;
int apb3_clk_freq = 0;


#endif

#ifdef __RNG__
uint32_t random32bit_generatedNumber;
#endif

#ifdef __TIME_DATE_ALARM__
char alarmMsg[] = "ALARM ALARM ALARM\n";
#endif



RTC_TimeTypeDef Time;
RTC_TimeTypeDef setTime;
RTC_DateTypeDef Date;
RTC_DateTypeDef setDate;
RTC_AlarmTypeDef Alarm;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC2_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_RNG_Init(void);
static void MX_RTC_Init(void);
static void MX_IWDG1_Init(void);
static void MX_WWDG1_Init(void);
/* USER CODE BEGIN PFP */
void set_time_custom();
void set_date_custom();
void set_alarm_custom();
void get_time_date();
int get_temperature();
void transmit_temperature(int temp);
void gen_random_number();

void FLASH_write();
void FLASH_clear();

void FLASH_Read(uint32_t StartPageAddress, uint32_t *RxBuf, uint16_t numberofwords);
void Print_readed_data(uint32_t holdMultipleRead[]);
int get_APB3_clk();
int hextodc(char *hex);
void custom_WWDG_refresh(WWDG_HandleTypeDef *hwwdg);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	  HAL_Init();
#ifdef __IWDG__
  HAL_Delay(1000);
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
#endif
	  /* USER CODE BEGIN Init */

	  /* USER CODE END Init */

	  /* Configure the system clock */
	  SystemClock_Config();

#ifdef __WWDG__
    check_loop_count_wwdg = 0;
	apb3_clk_freq = get_APB3_clk();
	#define APB3_PERI_CLK_VAL		apb3_clk_freq//5
	#define COUNTER_VAL				(((MAX_WINDOW_VAL*APB3_PERI_CLK_VAL*1000000)/(4096*PRESCALAR_WWDG))+64)+1
	#define WINDOW_VAL				(COUNTER_VAL - ((MIN_WINDOW_VAL*APB3_PERI_CLK_VAL*1000000)/(4096*PRESCALAR_WWDG)))+1
#endif

	// Use local
#ifdef __FLASH__
	uint32_t holdMultipleRead[DATA_READ_LOOP] = {0};

	for(int i=0; i<DATA_TRANSMIT_LENGTH; i++){
		buffer_tfs[i] = i;
	}
#endif
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */


  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC2_Init();
  MX_USART3_UART_Init();
  MX_RNG_Init();
  MX_RTC_Init();
  /* USER CODE BEGIN 2 */

#ifdef __IWDG__
  /* watchdog */
  MX_IWDG1_Init();
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
  HAL_UART_Transmit(&huart3, "uart initialized again\n", 23, 100);
  for(int i=0; i<=2; i++){
	  HAL_Delay(5000);
	  HAL_UART_Transmit(&huart3, "5 seconds\n", 10, 500);
	  HAL_IWDG_Refresh(&hiwdg1);
  }
#endif

  HAL_ADC_Start(&hadc2);

#ifdef __TIME_DATE_ALARM__
  /* set time, date & alarm */
  set_time_custom();
  set_date_custom();
  set_alarm_custom();
#endif

