axaypatoliya11/stm32-h7a3zi-q-peripherals/Core/Src/main.c
}

/* USER CODE BEGIN 4 */

#ifdef __WWDG__
void HAL_WWDG_EarlyWakeupCallback(WWDG_HandleTypeDef *hwwdg)
{
	check_loop_count_wwdg+=1;
	if(check_loop_count_wwdg == LOOP_COUNT_WWDG){
		HAL_UART_Transmit(&huart3, "system reboot using watchdog\n", sizeof("system reboot using watchdog\n"), 100);
	}
	else{
//		WRITE_REG(hwwdg->Instance->CR, (hwwdg->Init.Counter));
		HAL_UART_Transmit(&huart3, "inside else ISR\n", sizeof("inside else ISR\n"), 100);
		HAL_WWDG_Refresh(&hwwdg1);
	}
}

int get_APB3_clk(){
	/* get the clock freq of APB3 clock */
	uint32_t rcc_hpre = (RCC->CDCFGR1) & 0xf; //first 4 bits
	uint32_t rcc_cdppre = (RCC->CDCFGR1 >> 4) & 0x7; //bit 4,5,6
	uint32_t rcc_cdcpre = (RCC->CDCFGR1 >> 8) & 0x4; //bit 8,9,10,11
	uint32_t cdcpre_clock = {0};
	if(rcc_cdcpre == 0xf){
		cdcpre_clock = SYS_CLK/0x200;
	}
	else if(rcc_cdcpre == 0xe){
		cdcpre_clock = SYS_CLK/0x100;
	}
	else if(rcc_cdcpre == 0xd){
		cdcpre_clock = SYS_CLK/0x80;
	}
	else if(rcc_cdcpre == 0xc){
		cdcpre_clock = SYS_CLK/0x40;
	}
	else if(rcc_cdcpre == 0xb){
		cdcpre_clock = SYS_CLK/0x10;
	}
	else if(rcc_cdcpre == 0xa){
		cdcpre_clock = SYS_CLK/0x8;
	}
	else if(rcc_cdcpre == 0x9){
		cdcpre_clock = SYS_CLK/0x4;
	}
	else if(rcc_cdcpre == 0x8){
		cdcpre_clock = SYS_CLK/0x2;
	}
	else {
		cdcpre_clock = SYS_CLK;
	}

	uint32_t hpre_clock = {0};
	if(rcc_hpre == 0xf){
		hpre_clock = cdcpre_clock/0x200;
	}
	else if(rcc_hpre == 0xe){
		hpre_clock = cdcpre_clock/0x100;
	}
	else if(rcc_hpre == 0xd){
		hpre_clock = cdcpre_clock/0x80;
	}
	else if(rcc_hpre == 0xc){
		hpre_clock = cdcpre_clock/0x40;
	}
	else if(rcc_hpre == 0xb){
		hpre_clock = cdcpre_clock/0x10;
	}
	else if(rcc_hpre == 0xa){
		hpre_clock = cdcpre_clock/0x8;
	}
	else if(rcc_hpre == 0x9){
		hpre_clock = cdcpre_clock/0x4;
	}
	else if(rcc_hpre == 0x8){
		hpre_clock = cdcpre_clock/0x2;
	}
	else {
		hpre_clock = cdcpre_clock;
	}

	uint32_t apb3p_clock = {0};
	if(rcc_cdppre == 0x7){
		apb3p_clock = hpre_clock/0x10;
	}
	else if(rcc_cdppre == 0x6){
		apb3p_clock = hpre_clock/0x8;
	}
	else if(rcc_cdppre == 0x5){
		apb3p_clock = hpre_clock/0x4;
	}
	else if(rcc_cdppre == 0x4){
		apb3p_clock = hpre_clock/0x2;
	}
	else {
		apb3p_clock = hpre_clock;
	}

	apb3p_clock = apb3p_clock/0xF4240;
	char temp[2];
	sprintf(temp, "%x", apb3p_clock);
	int dec = 0;
	dec = hextodc(temp);
	return dec;
}

void custom_WWDG_refresh(WWDG_HandleTypeDef *hwwdg){
	WRITE_REG(hwwdg->Instance->CR, (hwwdg->Init.Counter));
	check_loop_count_wwdg = 0;
}

int hextodc(char *hex){
   int y = 0;
   int dec = 0;
   int x, i;
   for(i = strlen(hex) - 1 ; i >= 0 ; --i){
      if(hex[i]>='0'&&hex[i]<='9'){
         x = hex[i] - '0';
      }
      else{
         x = hex[i] - 'A' + 10;
      }
      dec = dec + x * pow(16 , y);// converting hexadecimal to integer value ++y;
   }
   return dec;
}

#endif


#ifdef __TEMPERATURE__
int get_temperature(){
	HAL_ADC_PollForConversion(&hadc2, 1000);
	readValue = HAL_ADC_GetValue(&hadc2);
	int temperature;
	temperature = (int)readValue - (uint32_t)*TS30;
	temperature *= (int)((uint32_t)110 - (uint32_t)30);
	temperature /= (int)(int32_t)((uint32_t)*TS110 - (uint32_t)*TS30);
	temperature += 30;
	return temperature;
}

void transmit_temperature(int temp){
	uint8_t temperature_c[100];
	uint8_t read[100];
	sprintf(temperature_c, "Temperature in Celsius: %d\n", temp);
	sprintf(read, "Temperature read: %d\n", readValue);
	HAL_UART_Transmit(&huart3, temperature_c, strlen(temperature_c), UART_TIMEOUT);
	HAL_UART_Transmit(&huart3, read, strlen(read), UART_TIMEOUT);
}
#endif

#ifdef __RNG__
void gen_random_number(){
	HAL_RNG_GenerateRandomNumber(&hrng, &random32bit_generatedNumber);
	uint8_t rng_data[100] = {0};
	sprintf(rng_data, "Generated random number: %d", random32bit_generatedNumber);
	HAL_UART_Transmit(&huart3, rng_data, strlen(rng_data), UART_TIMEOUT);
	HAL_UART_Transmit(&huart3, "\n", 1, UART_TIMEOUT);
}
#endif

#ifdef __TIME_DATE_ALARM__
void HAL_RTC_AlarmAEventCallback(RTC_HandleTypeDef *hrtc)
{
  HAL_UART_Transmit(&huart3, (uint8_t*)alarmMsg, strlen(alarmMsg), UART_TIMEOUT);
}

void get_time_date(){
	char time[30];
	char date[30];
	HAL_RTC_GetDate(&hrtc, &Date, RTC_FORMAT_BIN);
	sprintf(date, "Date: %02d.%02d.%02d\n", Date.Date, Date.Month, Date.Year);
	HAL_RTC_GetTime(&hrtc, &Time, RTC_FORMAT_BIN);
	sprintf(time, "Time: %02d:%02d:%02d\n", Time.Hours, Time.Minutes, Time.Seconds);
	HAL_UART_Transmit(&huart3, (uint8_t*)date, strlen(date), 5*UART_TIMEOUT);
	HAL_UART_Transmit(&huart3, (uint8_t*)time, strlen(time), 5*UART_TIMEOUT);
}

void set_time_custom(){
	if(HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR0) != 0xFF){
		setTime.Hours = 0xb;
		setTime.Minutes = 0xb;
		setTime.Seconds = 0x00;
		HAL_RTC_SetTime(&hrtc, &setTime, RTC_FORMAT_BIN);
		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR0, 0xFF);
	} else{
		uint8_t temp[100] = {0};
		sprintf(temp, "time already set buddy! %d\n", HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR0));
		HAL_UART_Transmit(&huart3, temp, strlen(temp), 5*UART_TIMEOUT);
	}
}

void set_date_custom(){
	setDate.Date = 0xa;
	setDate.Month = 0xa;
	setDate.Year = 0x16;
	HAL_RTC_SetDate(&hrtc, &setDate, RTC_FORMAT_BIN);
}

void set_alarm_custom(){
	Alarm.Alarm = RTC_ALARM_A;
	Alarm.AlarmTime.Hours = 0xb;
	Alarm.AlarmTime.Minutes = 0xc;
	Alarm.AlarmTime.Seconds = 0x00;
	Alarm.AlarmMask = RTC_ALARMMASK_DATEWEEKDAY;
	HAL_RTC_SetAlarm_IT(&hrtc, &Alarm, RTC_FORMAT_BIN);
	uint8_t temp[] = "alarm set!\n";
	HAL_UART_Transmit(&huart3, (uint8_t*)temp, strlen(temp), 5*UART_TIMEOUT);
}
#endif

#ifdef __FLASH__
void FLASH_Read(uint32_t StartPageAddress, uint32_t *RxBuf, uint16_t numberofwords){
	uint32_t temp;
	while (1)
		{
			*RxBuf = *(__IO uint32_t *)StartPageAddress;
			StartPageAddress+=4;
			RxBuf++;
			if (!(--numberofwords)) break;
		}
}

void Print_readed_data(uint32_t holdMultipleRead[]){
	uint8_t temp_data[10] = {0};
	uint16_t a,b;
	for(int i=0; i<DATA_READ_LOOP; i++){
	  a = holdMultipleRead[i]>>16;
	  b = holdMultipleRead[i] & 0x0000ffff;
	  sprintf(temp_data, "%d\n%d\n", b,a);
	  HAL_UART_Transmit(&huart3, temp_data, strlen(temp_data), UART_TIMEOUT);
  }
}

void FLASH_write(){
	// unlock the flash to write
	  if(HAL_FLASH_Unlock() != HAL_OK){
		  HAL_UART_Transmit(&huart3, "fail" ,4, 5*UART_TIMEOUT);
	  }
	  for(int i=0; i<DATA_TRANSMIT_LOOP; i++){
		  if(HAL_FLASH_Program(FLASH_TYPEPROGRAM_FLASHWORD, (uint32_t)send_address, &buffer_tfs[i*8]) != HAL_OK)
		  {
			  HAL_UART_Transmit(&huart3, "fail" ,4, 5*UART_TIMEOUT);
		  }
	  send_address+=16;
	}
	// lock the flash once done writing
	if(HAL_FLASH_Lock() != HAL_OK){
	  HAL_UART_Transmit(&huart3, "fail" ,4, 5*UART_TIMEOUT);
	}
}

