axaypatoliya11/stm32-h7a3zi-q-peripherals/Core/Src/main.c
void FLASH_clear(){
	if(HAL_FLASH_Unlock() != HAL_OK){
		  HAL_UART_Transmit(&huart3, "fail" ,4, 5*UART_TIMEOUT);
	  }
	  uint32_t PAGEError;
	  FLASH_EraseInitTypeDef EraseInitStruct;
	  EraseInitStruct.TypeErase = FLASH_TYPEERASE_SECTORS;
	  EraseInitStruct.NbSectors = 1;
	  EraseInitStruct.Banks = FLASH_BANK_1;
	  EraseInitStruct.Sector = FLASH_SECTOR_127;
	  if(HAL_FLASHEx_Erase(&EraseInitStruct, &PAGEError) != HAL_OK)
	  {
		  HAL_UART_Transmit(&huart3, "fail" ,4, 5*UART_TIMEOUT);
	  }
	  if(HAL_FLASH_Lock() != HAL_OK){
	    HAL_UART_Transmit(&huart3, "fail" ,4, 5*UART_TIMEOUT);
	  }
}
#endif
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
